Feature: Управление на график

  Scenario: Създаване на график от зъболекар без дати
    Given В системата влизаме с профил с роля Зъболекар
    And Отваряме екрана за създаване на график
    When Натискаме бутона за създаване
    Then Виждаме съобщение: "Въведете валидни дати"

    Scenario: Създаване на график от служител на рецепция без дати
    Given В системата влизаме с профил с роля Служител
    And Отваряме екрана за създаване на график
    When Натискаме бутона за създаване
    Then Виждаме съобщение: "Нямате права да създавате график"
    
    
    Scenario: Създаване на график от зъболекар с дати
    Given В системата влизаме с профил с роля Зъболекар
    And Отваряме екрана за създаване на график
    When Въведе начален час 2021,12,21,10,15
    And Въведе краен час 2021,12,21,19,15
    And Натискаме бутона за създаване
    Then Виждаме съобщение: "Успешно създадохте график"
    
  
 
 Scenario: Създаване на график от служител на рецепция с дати
    Given В системата влизаме с профил с роля Служител
    And Отваряме екрана за създаване на график
    When Въведе начален час 2021,12,21,10,15
    When Въведе краен час 2021,12,21,19,15
    And Натискаме бутона за създаване
    Then Виждаме съобщение: "Нямате права да създавате график"